In [20]:
import numpy as np
import pandas as pd

In [21]:
idx = np.array(["a", "b", "c"])
pd.Series([1,2,3,], idx)

a    1
b    2
c    3
dtype: int64

In [22]:
pd.Series([1,2,3,4,5], ["a", "b", "c", "d", "e"])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [23]:
# dataframe: 2d labeled data structure
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000],
}
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [24]:
# reading and writting data
test_csv = pd.read_csv("test.csv")

In [25]:
# inspecting data
test_csv.head(3)
test_csv.tail(2)
# test_csv.info()
test_csv.shape
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [26]:
# filtering data.
df[df["Age"]>30]
df[(df['Age'] > 25) & (df['Name']=='Bob')]

  Name   Age Department   Salary
1  Bob  30.0         IT  60000.0

In [27]:
# Handling missing data
df.isnull().sum() # check
df.dropna() # drop missing how= "any" , how= "all"
df["Salary"].fillna(method= "bfill")

C:\Users\deveh\AppData\Local\Temp\ipykernel_10920\1214567689.py:4: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Salary"].fillna(method= "bfill")

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    50000.0
5    50000.0
Name: Salary, dtype: float64

In [28]:
# adding and modifying collum
# df["New"] = df.Age * 2
# df

In [29]:
# dropping collum or rows
df.drop("Age", axis=1)
df.drop(2, axis=0)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [30]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [34]:
# Aggregation
test_csv
test_csv["Age"] + 5
# test_csv

0    30.0
1    35.0
2    40.0
3     NaN
4    34.0
5    30.0
Name: Age, dtype: float64

In [44]:
# Sorting
df.sort_values("Age", ascending=True) # by collum

train_data = pd.read_csv("train.csv")
sample_td = train_data.sample(5)
sample_td.sort_index(axis=0) # by index

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
270,271,0,1,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S
355,356,0,3,"Vanden Steen, Mr. Leo Peter",male,28.0,0,0,345783,9.5000,NaN,S
360,361,0,3,"Skoog, Mr. Wilhelm",male,40.0,1,4,347088,27.9000,NaN,S
464,465,0,3,"Maisner, Mr. Simon",male,NaN,0,0,A/S 2816,8.0500,NaN,S
646,647,0,3,"Cor, Mr. Liudevit",male,19.0,0,0,349231,7.8958,NaN,S

In [56]:
# Merging the data frame
# pd.concat([df, test_csv], axis=0)
# pd.merge(df, test_csv, on="key_column", how="inner")

In [ ]:
# working with text data
df.Name.str.lower() # transform to lower case 
df.Name.str.contains("David") # check the name 
df.Name.str.replace("D", "O") # transform the letter

0      Alice
1        Bob
2    Charlie
3      Oavid
4        Eve
5      Alice
Name: Name, dtype: object

In [74]:
# quick stats
# df["Age"].value_counts() # count of unique values
# df["Age"].unique()